#@ # 
#@ # Running pt_shell Version G-2012.06-SP2 for amd64 -- Aug 30, 2012
#@ # Date:   Fri Apr  6 14:29:03 2018
#@ # Run by: ahesham@localhost.localdomain
#@ 

source /usr/synopsys/PrimeTime/admin/setup/.synopsys_pt.setup
#@ # -- Starting source /usr/synopsys/PrimeTime/admin/setup/.synopsys_pt.setup

#@ #
#@ # .synopsys_pt.setup: Initialization File for PrimeTime
#@ #
#@ 
#@ 
#@ #
#@ # Enable stack trace output on fatal.  Not available for all architectures.
#@ #
#@ if { $sh_arch == "sparcOS5" || $sh_arch == "hpux10" ||      $sh_arch == "hp32" || $sh_arch == "linux" } {
#@   set_unix_variable SYNOPSYS_TRACE ""
#@ }
#@ 
#@ #
#@ # Variable settings
#@ #
#@ 
#@ #
#@ # Synopsys strongly recommends that you use new variable message
#@ # tracing for debugging purposes only.
#@ #
#@ set sh_new_variable_message true
#@ 
#@ #
#@ # Synopsys strongly recommends that you uncomment the following command
#@ # in order to set sh_command_abbrev_mode to the value "Command-Line-Only".
#@ # Command abbreviation is intended as an interactive convenience.  Using
#@ # abbreviations in scripts can cause commands to fail in subsequent releases.
#@ # 
#@ #set sh_command_abbrev_mode "Command-Line-Only"
#@ 
#@ #
#@ # Some useful aliases
#@ #
#@ alias list_commands		help
#@ alias report_constraints	report_constraint
#@ alias report_clocks		report_clock
#@ 
#@ #
#@ # The alias for get_clock was added when get_clock_network_objects
#@ # was introduced, as it conflicts with get_clocks (and get_clock is a
#@ # typical abbreviation for get_clocks)
#@ #
#@ alias get_clock get_clocks
#@ 
#@ 
#@ #
#@ #
#@ # The alias of q to quit is commented out.  Remove the comment 
#@ # character if you want this alias.  Some users find that having 
#@ # this particular alias causes problems when mixed with page-mode
#@ # for reports - an accidental repeated 'q' not only cancels the
#@ # output but exits the tool.
#@ #
#@ #alias q quit
#@ 
#@ # -- End source /usr/synopsys/PrimeTime/admin/setup/.synopsys_pt.setup

source /home/ahesham/Desktop/Teaching/ali_maher/tool_variables_container.tcl
#@ # -- Starting source /home/ahesham/Desktop/Teaching/ali_maher/tool_variables_container.tcl

#@ ##############################################
#@ ########## CLOCK CONSTRAINTS  ################
#@ ##############################################
#@ 
#@ # variables used in create_clock
#@ set clock_period 2
#@ set posedge_time {0 1}
#@ # variable used in uncertainty
#@ set clk_uncertainty [ expr $clock_period/11.42857142857143 ]
#@ # input and output delay
#@ set inout_delay [ expr $clock_period/2 ]
#@ 
#@ ##############################################
#@ ########### 2. Floorplan #####################
#@ ##############################################
#@ 
#@ # core utilization option in create_floorplan
#@ set core_util 0.4
#@ # distance between dye and core in floorplan
#@ set io_dist   12.4
#@ 
#@ ##################################################
#@ ########### 3. POWER NETWORK #####################
#@ ##################################################
#@ 
#@ set ring_space 0.8 
#@ set ring_width 5
#@ set ring_offset 0.8
#@ 
#@ ##############################################
#@ ########### 5. CTS       #####################
#@ ##############################################
#@ 
#@ set max_skew 0.5
#@ # -- End source /home/ahesham/Desktop/Teaching/ali_maher/tool_variables_container.tcl

set link_path  "/home/standard_cell_libraries/NangateOpenCellLibrary_PDKv1_3_v2010_12/lib/Front_End/Liberty/NLDM/NangateOpenCellLibrary_ff1p25v0c.db"
read_verilog "../../../pnr/output/mips_16_icc.v"
current_design mips_16
link
source ../../../syn/cons/cons.tcl
#@ # -- Starting source ../../../syn/cons/cons.tcl

#@ create_clock -name clk -period $clock_period -waveform $posedge_time [get_ports clk]
#@ 
#@ set_input_delay -max $inout_delay -clock [get_clocks clk] [remove_from_collection [all_inputs] [get_ports clk]]
#@ 
#@ set_output_delay -max $inout_delay -clock [get_clocks clk] [all_outputs]
#@ 
#@ set_clock_uncertainty $clk_uncertainty [get_clocks]
#@ 
#@ set_false_path -hold -from [remove_from_collection [all_inputs] [get_ports clk]]
#@ 
#@ set_false_path -hold -to [all_outputs]
#@ 
#@ # -- End source ../../../syn/cons/cons.tcl

read_parasitics ../../../pnr/output/mips_16.spef.min
update_timing
save_session mips_16_min_solveddrc1.session
report_constraint -all_violators -significant_digits 4
report_timing -delay_type min -significant_digits 4
report_timing -delay_type max -significant_digits 4
exit
